# Kural Tabanlı Sınıflandırma ile Potansiyel Müşteri Getirisi Hesaplama
# İş Problemi
     # Bir oyun şirketi müşterilerinin bazı özelliklerini kullanarak seviye tabanlı (level based) yeni müşteri tanımları      (persona) oluşturmak ve bu yeni müşteri tanımlarına göre segmentler oluşturup bu segmentlere göre yeni gelebilecek        müşterilerin şirkete ortalama ne kadar kazandırabileceğini tahmin etmek istemektedir.
     
# Örneğin:
    Türkiye’den IOS kullanıcısı olan 25 yaşındaki bir erkek kullanıcının ortalama ne kadar kazandırabileceği belirlenmek     isteniyor.
   
# Veri Seti Hikayesi

    Persona.csv veri seti uluslararası bir oyun şirketinin sattığı ürünlerin fiyatlarını ve bu ürünleri satın alan           kullanıcıların bazı demografik bilgilerini barındırmaktadır. Veri seti her satış işleminde oluşan kayıtlardan meydana     gelmektedir. Bunun anlamı tablo tekilleştirilmemiştir. Diğer bir ifade ile belirli demografik özelliklere sahip bir       kullanıcı birden fazla alışveriş yapmış olabilir.

# Değişkenler

    persona.csv
    PRICE – Müşterinin harcama tutarı 
    SOURCE – Müşterinin bağlandığı cihaz türü 
    SEX – Müşterinin cinsiyeti
    COUNTRY – Müşterinin ülkesi 
    AGE – Müşterinin yaşı

In [ ]:
# persona.csv dosyasını okuttuk ve veri seti ile ilgili genel bilgiler gösterildi.

In [1]:
import pandas as pd
df = pd.read_csv("persona.csv")
df

      PRICE   SOURCE     SEX COUNTRY  AGE
0        39  android    male     bra   17
1        39  android    male     bra   17
2        49  android    male     bra   17
3        29  android    male     tur   17
4        49  android    male     tur   17
...     ...      ...     ...     ...  ...
4995     29  android  female     bra   31
4996     29  android  female     bra   31
4997     29  android  female     bra   31
4998     39  android  female     bra   31
4999     29  android  female     bra   31

[5000 rows x 5 columns]

In [4]:
df.shape

(5000, 5)

In [5]:
df.dtypes

PRICE       int64
SOURCE     object
SEX        object
COUNTRY    object
AGE         int64
dtype: object

In [ ]:
# Kaç unique SOURCE vardır? Frekansları nedir?

In [6]:
df["SOURCE"].nunique()

2

In [7]:
df["SOURCE"].value_counts()

android    2974
ios        2026
Name: SOURCE, dtype: int64

In [ ]:
# Kaç unique PRICE vardır?

In [8]:
df["PRICE"].nunique()

6

In [ ]:
# Hangi PRICE'dan kaçar tane satış gerçekleşmiş?

In [ ]:
df["PRICE"].value_counts()

In [ ]:
# Hangi ülkeden kaçar tane satış olmuş?

In [9]:
df["COUNTRY"].value_counts()
df.groupby("COUNTRY")["PRICE"].count()

COUNTRY
bra    1496
can     230
deu     455
fra     303
tur     451
usa    2065
Name: PRICE, dtype: int64

In [ ]:
# Ülkelere göre satışlardan toplam ne kadar kazanılmış?

In [10]:
df.groupby("COUNTRY")["PRICE"].sum()
df.groupby(['COUNTRY'])[['PRICE']].agg('sum')

         PRICE
COUNTRY
bra      51354
can       7730
deu      15485
fra      10177
tur      15689
usa      70225

In [ ]:
# SOURCE türlerine göre satış sayıları nedir?

In [11]:
df.groupby("SOURCE")["PRICE"].count()
df.groupby(["SOURCE"])[["PRICE"]].agg("count")

         PRICE
SOURCE
android   2974
ios       2026

In [ ]:
# Ülkelere göre PRICE ortalamaları nedir?

In [12]:
df.groupby("COUNTRY")["PRICE"].mean()
df.groupby(['COUNTRY'])[['PRICE']].agg('mean')

             PRICE
COUNTRY
bra      34.327540
can      33.608696
deu      34.032967
fra      33.587459
tur      34.787140
usa      34.007264

In [ ]:
# SOURCE'lara göre PRICE ortalamaları nedir?

In [13]:
df.groupby("SOURCE")["PRICE"].mean()
df.groupby(['SOURCE'])[['PRICE']].agg('mean')

             PRICE
SOURCE
android  34.174849
ios      34.069102

In [ ]:
# COUNTRY-SOURCE kırılımında PRICE ortalamaları nedir?

In [ ]:
df.groupby(["COUNTRY","SOURCE"])["PRICE"].mean()
df.groupby(["COUNTRY","SOURCE"])[["PRICE"]].mean()
df.groupby(["COUNTRY","SOURCE"])[["PRICE"]].mean().unstack()

In [ ]:
# COUNTRY, SOURCE, SEX, AGE kırılımında ortalama kazançlar nedir?

In [15]:
df.groupby(["COUNTRY","SOURCE","SEX","AGE"])["PRICE"].mean()
df.groupby(["COUNTRY","SOURCE","SEX","AGE"])[["PRICE"]].agg("mean")
agg_df = df.groupby([x for x in df.columns[df.columns != 'PRICE']]).mean();agg_df

                                PRICE
SOURCE  SEX    COUNTRY AGE
android female bra     15   38.714286
                       16   35.944444
                       17   35.666667
                       18   32.255814
                       19   35.206897
...                               ...
ios     male   usa     42   30.250000
                       50   39.000000
                       53   34.000000
                       55   29.000000
                       59   46.500000

[348 rows x 1 columns]

In [ ]:
# Çıktıyı PRICE’a göre sıralandı.

In [16]:
agg_df = df.sort_values(by=['PRICE'], ascending=False)
agg_df

      PRICE   SOURCE     SEX COUNTRY  AGE
4503     59      ios    male     fra   15
995      59  android    male     usa   47
3343     59  android    male     tur   24
2294     59  android    male     fra   15
3716     59      ios    male     bra   16
...     ...      ...     ...     ...  ...
4757      9      ios    male     tur   17
1625      9      ios  female     tur   38
2490      9      ios    male     bra   17
4397      9  android    male     usa   22
2500      9      ios    male     deu   32

[5000 rows x 5 columns]

In [17]:
# Indekste yer alan isimleri değişken ismine çevirildi.

In [18]:
agg_df.reset_index(inplace = True)
agg_df

      index  PRICE   SOURCE     SEX COUNTRY  AGE
0      4503     59      ios    male     fra   15
1       995     59  android    male     usa   47
2      3343     59  android    male     tur   24
3      2294     59  android    male     fra   15
4      3716     59      ios    male     bra   16
...     ...    ...      ...     ...     ...  ...
4995   4757      9      ios    male     tur   17
4996   1625      9      ios  female     tur   38
4997   2490      9      ios    male     bra   17
4998   4397      9  android    male     usa   22
4999   2500      9      ios    male     deu   32

[5000 rows x 6 columns]

In [ ]:
# Age değişkenini kategorik değişkene çevirildi ve agg_df’e eklendi.

In [19]:
agg_df["AGE"] = agg_df["AGE"].astype("category")
agg_df["AGE"].dtypes

CategoricalDtype(categories=[15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29,
                  30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44,
                  45, 46, 47, 49, 50, 51, 52, 53, 54, 55, 56, 57, 59, 61, 65,
                  66],
, ordered=False)

In [20]:
agg_df["AGE_CAT"] = pd.cut(agg_df["AGE"], bins=[0, 18, 23, 30, 40, 70],
                           labels=['0_18', '19_23', '24_30', '31_40','41_70'])
agg_df

      index  PRICE   SOURCE     SEX COUNTRY AGE AGE_CAT
0      4503     59      ios    male     fra  15    0_18
1       995     59  android    male     usa  47   41_70
2      3343     59  android    male     tur  24   24_30
3      2294     59  android    male     fra  15    0_18
4      3716     59      ios    male     bra  16    0_18
...     ...    ...      ...     ...     ...  ..     ...
4995   4757      9      ios    male     tur  17    0_18
4996   1625      9      ios  female     tur  38   31_40
4997   2490      9      ios    male     bra  17    0_18
4998   4397      9  android    male     usa  22   19_23
4999   2500      9      ios    male     deu  32   31_40

[5000 rows x 7 columns]

In [ ]:
# Yeni seviye tabanlı müşterileri (persona) tanımlandı.

In [21]:
agg_df['CUSTOMERS_LEVEL_BASED'] = ['_'.join(i).upper() for i in agg_df[['COUNTRY', 'SOURCE', "SEX", "AGE_CAT"]].values]
agg_df
agg_df = agg_df.groupby(["CUSTOMERS_LEVEL_BASED"])[['PRICE']].agg('mean')
agg_df
agg_df.reset_index(inplace = True)
agg_df

        CUSTOMERS_LEVEL_BASED      PRICE
0     BRA_ANDROID_FEMALE_0_18  35.439394
1    BRA_ANDROID_FEMALE_19_23  34.114943
2    BRA_ANDROID_FEMALE_24_30  34.540541
3    BRA_ANDROID_FEMALE_31_40  34.696203
4    BRA_ANDROID_FEMALE_41_70  35.086957
..                        ...        ...
104         USA_IOS_MALE_0_18  34.054348
105        USA_IOS_MALE_19_23  35.304348
106        USA_IOS_MALE_24_30  36.096774
107        USA_IOS_MALE_31_40  32.333333
108        USA_IOS_MALE_41_70  35.842105

[109 rows x 2 columns]

In [ ]:
# Yeni müşterileri (personaları) segmentlere ayırıldı.

In [22]:
agg_df["SEGMENT"] =  pd.qcut(agg_df["PRICE"], 4 , labels =["D","C","B","A"])
agg_df
agg_df.groupby(["SEGMENT"])[["PRICE"]].agg(["mean", "max", "sum"])

             PRICE
              mean        max          sum
SEGMENT
D        30.113161  32.658537   843.168512
C        33.512842  34.000000   971.872429
B        34.681428  35.439394   867.035711
A        37.544294  45.000000  1013.695935

In [ ]:
# Yeni gelen müşterileri sınıflandırıp, ne kadar gelir getirebileceklerini tahmin edildi.

In [ ]:
# 31 yaşında ANDROID kullanan bir Türk kadını hangi segmente aittir ve ortalama ne kadar gelir kazandırması beklenir?

In [27]:
new_user = "TUR_ANDROID_FEMALE_31_40"
agg_df[agg_df["CUSTOMERS_LEVEL_BASED"] == new_user]

       CUSTOMERS_LEVEL_BASED      PRICE SEGMENT
72  TUR_ANDROID_FEMALE_31_40  41.727273       A

In [ ]:
# 31 yaşında IOS kullanan bir Fransız kadını hangi segmente aittir ve ortalama ne kadar gelir kazandırması beklenir?

In [26]:
new_user_2 = 'FRA_IOS_FEMALE_31_40'
agg_df[agg_df['CUSTOMERS_LEVEL_BASED'] == new_user_2]

   CUSTOMERS_LEVEL_BASED  PRICE SEGMENT
63  FRA_IOS_FEMALE_31_40  32.75       C